[
  {
    "id": "portfolio1",
    "image": "/portfolio/finsweet-site.png",
    "alt": "FinSweet Restaurant website",
    "title": "FinSweet Restaurant",
    "preview": "https://finsweet-restaurant.vercel.app/",
    "source": "https://github.com/muchirijane/next-finsweet-restaurant",
    "stack": ["React", "Next Js", "Material UI", "Framer-Motion"],
    "content": "This is a restaurant website that showcase why others should enjoy their meals which is sourced from their farm and from the locals. By making meals that are organic they have increased their reach to other states and through the site others can order meals or book a reservation. Used Next Js and Material UI to create the front end side and framer motion for animations. "
  },
  {
    "id": "portfolio2",
    "image": "/portfolio/airbnb.png",
    "alt": "Budgetfy Financial App",
    "title": "Airbnb Clone App",
    "preview": "https://next-budget-app.vercel.app/",
    "source": "https://github.com/muchirijane/airbnb-sanity-frontend",
    "stack": ["Javascript", "React-JS", "Next Js", "Sanity"],
    "content": " Airbnb frontend clone was created from scratch with data created from sanity io as a backend with different schemas. In the backend you can add details about the property like: location, description, multiple images, reviews and the hosts of each property. The frontend was built with Next to fetch data from sanity to render it to the client side. "
  },
  {
    "id": "portfolio3",
    "image": "/portfolio/budget-app.png",
    "alt": "Budgetfy Financial App",
    "title": "Budgetfy Financial App",
    "preview": "https://next-budget-app.vercel.app/",
    "source": "https://github.com/muchirijane/next-budget-app",
    "stack": ["Html", "CSS-modules", "Javascript", "React-JS"],
    "content": " Budgetfy App helps you to keep track of when you spend your expenses and see which month you spent the most. This project increased my understanding of using react hooks like state and reducer to handle the form values. Used scoped styles by applying CSS modules to ensure they are only applied to that specific file."
  },
  {
    "id": "portfolio4",
    "image": "/portfolio/product-site.png",
    "alt": "Product Agency website preview",
    "title": "Product Agency website",
    "preview": "https://next-product-site.vercel.app/",
    "source": "https://github.com/muchirijane/next-product-site",
    "stack": ["Javascript", "React", "Next JS", "Material UI| MUI"],
    "content": "Product website is a design agency that creates the most intuitive ways to make a better User Experience for your products. This is by following tools, tutorials and experts they are in their team. This site was created as a way Open Source project for Hacktoberfest 2021. Developer from the open source community made this website from the design to the live site with Next JS and Material UI(MUI)."
  }
]
